{
    "version": "https://jsonfeed.org/version/1",
    "title": "ritx-cyber501x",
    "description": "",
    "home_page_url": "https://therealmccoy.github.io/ritx-cyber501x",
    "feed_url": "https://therealmccoy.github.io/ritx-cyber501x/feed.json",
    "user_comment": "",
    "author": {
        "name": "abhishek rai"
    },
    "items": [
        {
            "id": "https://therealmccoy.github.io/ritx-cyber501x/lessons-from-the-target-data-breach-of-2013/",
            "url": "https://therealmccoy.github.io/ritx-cyber501x/lessons-from-the-target-data-breach-of-2013/",
            "title": "Lessons from the Target data breach of 2013",
            "content_html": "<p class=\"msg msg--info\">***************************************************************************************<br>***************************************************************************************<br>File Name: Additional-Resources-General-Unit-One-A-13042018<br>About: Notes from additional resources (General) supplied in unit one of RITx:CYBER501x course on Edx.<br>Author: Abhishek Rai<br>Date: 13th April 2018<br>Day: Friday<br>***************************************************************************************<br>***************************************************************************************<br><br></p>\n<h2>|||&gt; 11 Steps Attackers Took to Crack Target &lt;|||</h2>\n<p> <a href=\"https://www.cio.com/article/2600345/security0/11-steps-attackers-took-to-crack-target.html?page=2\">Link to the article</a><br>==========================================================<br><br></p>\n<h5>1. Vendors - High Risk</h5>\n<p><br> a. Can compromise information security, if they are non-compliant.<br> b. Access should be limited and quarantined. But how?<br> - Requires audit of what is essential for them.<br> - Access on Need-To-Know basis only.<br> - Pertinent access to parent network is evil, as far as vendors are concerned.</p>\n<h5><br>2. Malware - Citadel, a general purpose malware used.</h5>\n<p> </p>\n<p>- Research on what it is and how it works? [#td]<br> - Other similar tools? [#td]<br> - Patches available? [#td]<br> - How to know when the malware installs itself?<br> - Signatures? [#td]</p>\n<h5><br><br>3. Web services dedicated to vendors</h5>\n<p><br> - Application Security?<br> - Access to whom and why?<br> - 2FA on these systems?<br> - Credentials security?<br> - Routine forced update?<br> - Storage audit?<br> - Automatic credentials expiry, in case of personnel movement, internal or external.</p>\n<h5><br>4. Which kind of files are allowed to be uploaded in to the system?</h5>\n<h5><br><br>5. \"Hiding in plain sight\", like renaming the malicious components as popular and important files / components?</h5>\n<h5><br>6. Obfuscation of Active Directory</h5>\n<p><br> - Storing everything in a single directory is high risk.<br> - Restricted access to directory querying.<br> - LDAP Protocol [#td]<br> - Obfuscation of services string, so that their purpose cannot be inferred just by reading their name.</p>\n<h5><br>7. Security of DNS Server</h5>\n<p><br> - Query is allowed?</p>\n<h5><br>8. \"Pass the hash\" attack technique [#td]</h5>\n<h5><br><br>9. New account alert to domain admin group or any such administrative group.</h5>\n<p><br> - Account addition with 2FA only</p>\n<h5><br>10. Monitoring of access paterns.</h5>\n<p><br> - Admin accounts<br> - Domain accounts</p>\n<h5><br>11. Monitoring for reconnaisance</h5>\n<p><br> - Querying<br> - Is there any history or precedence for such querying?</p>\n<h5><br>12. Angry IP Scanner (Tool Used) [#td]</h5>\n<h5><br><br>13. Porrt forwarding tool (Tool Used) [#td]</h5>\n<h5><br><br>14. Microsoft PSExec utility (a telnet-replacement for executing processes on other systems) (Tool Used) [#td]</h5>\n<h5><br><br>15. Microsoft Orchestrator management solution to gain persistent access. (Tool Used) [#td]</h5>\n<h5><br>16. Custom written malware tool - Kaptoxa (Tool Used)</h5>\n<h5><br><br>17. From the article:</h5>\n<p class=\"msg msg--highlight \"><br><br>Be'ery recommends that organizations take the following steps to protect themselves: <br> <br> a. Harden access controls. Monitor and profile access patterns to systems to identify abnormal and rogue access patterns. Where possible, use multi-factor authentication to sensitive systems to reduce risks associated with theft of credentials. Segregate networks, limit allowed protocols usage and limit users' excessive privileges.<br> <br> b. Monitor users' lists for the addition of new users, especially privileged ones.<br> <br> c. Monitor for signs of reconnaissance and information gathering. Pay special attention to excessive and abnormal LDAP queries.<br> <br> d. For sensitive, single-purpose servers, consider whitelisting of allowed programs.<br> <br> e. Don't rely on anti-malware solutions as a primary mitigation measure since attackers mostly leverage legitimate IT tools.<br> <br> f. Place security and monitoring controls around Active Directory as it is involved in nearly all stages of the attack.<br> <br> g. Participate in Information Sharing and Analysis Center (ISAC) and Cyber Intelligence Sharing Center (CISC) groups to gain valuable intelligence on attackers' Tactics, Techniques and Procedures (TTPs).</p>",
            "author": {
                "name": "abhishek rai"
            },
            "tags": [
                   "dataBreach",
                   "CyberSecurity",
                   "CYBER501x"
            ],
            "date_published": "2018-04-13T11:27:07+05:30",
            "date_modified": "2018-04-13T11:27:07+05:30"
        },
        {
            "id": "https://therealmccoy.github.io/ritx-cyber501x/notes-from-unit-1-computing-security-concepts-and-problems-1/",
            "url": "https://therealmccoy.github.io/ritx-cyber501x/notes-from-unit-1-computing-security-concepts-and-problems-1/",
            "title": "Notes From -  Unit 1: Computing Security Concepts and Problems 1 ",
            "content_html": "<h4>A. Defining Cybersecurity:</h4>\n<p><br>i) Cyber security is a great umbrella term referring to protecting the confidentiality, integrity, and availability of computing devices and networks, hardware, software and most importantly, data and information.</p>\n<p><br>ii) Cyber security involves times when data or information is in transit, being processed, and at rest.</p>\n<p>iii) The weakest link in cybersecurity framework are the humans, and they often fall to victimm to social engineering attacks, making all products, procedures redundant in the entire framework.</p>\n<p>iv) Insiders are a much greater threat, and can do far greater damage.They already have some level of access, means, and opportunity.</p>\n<p>v) Treating each attack as an isolated incident is a huge mistake. There needs to be greater intelligence, correlated attacks, to previous attacks,both within a company and between companies.<br><br></p>\n<h4>B.) Vulnerabilities:</h4>\n<p>The security mindset involves thinking about how things can be made to fail. It involves thinking like an attacker, an adversary or a criminal.<br><br></p>\n<h4>C.) Personal Security:</h4>\n<p>Attacks are becoming increasingly complex, relying on a combination of techniques,including exploitation of software vulnerabilities, and improper configuration,malicious software, malware, and social engineering.<br><br></p>\n<h4>D.) Who are the hackers?:</h4>\n<p>i) A hacker is someone who thinks outside the box, is technologically-inclined,and finds unconventional solutions to problems, focusing on what is important.</p>\n<p>ii) Cracker was the original term for a malicious hacker.</p>\n<p>iii) Script kiddies are inexperienced crackers, who use scripts and programs developed by others.They often don't know what they're clicking or initiating, nor do they have any idea of the scope, or consequences of their actions.</p>\n<p>iv) The FBI define the motivation of individuals who commit espionage against the country,with the acronym, MICE, money, ideology, compromise or coercion, ego or extortion.</p>\n<p>v) Researcher, Max Kilger, proposed that the motivations for the hacker community can be thought of as MEECES, money, ego,<br>entertainment, cause, entrance, and status.<br><br></p>\n<h4>E.) Data Breaches:</h4>\n<p>i) Announced in 2013, Target, 70 million customers affected.The breach started when credentials from their HVAC company were stolen.</p>\n<p>ii) The breach started because JP Morgan's security team didn't upgrade a server with two-factor authentication.</p>\n<p>iii) Home Depot, 56 million customers affected.Like Target, the breach started from credentials stolen from a third-party vendor.Unpatched Windows systems were also directly in the mix.</p>\n<p>iv) Major League Baseball's Houston Astros.A front office executive went from the St. Louis Cardinals to the Houston Astros, changing jobs,and was required to turn his laptop and password.A Cardinals executive tried the former executive's old password on the computer systems in Houston, his new digs.After mixing and matching with the old Cardinals' password, he got in.</p>\n<p>v) The Ukraine power grid was hacked and would be again the following year, 2016.The first attacks started when workers clicked on an attachment,enabling macros in a Microsoft Word document.<br><br></p>",
            "author": {
                "name": "abhishek rai"
            },
            "tags": [
                   "RITx",
                   "RIT",
                   "EDx",
                   "CyberSecurity",
                   "ComputingSecurity",
                   "CYBER501x"
            ],
            "date_published": "2018-04-12T10:45:57+05:30",
            "date_modified": "2018-04-12T10:47:15+05:30"
        }
    ]
}
